# UsesGroundPlane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..UsesGroundPlane Property
SunAndShadowSettings Class See Also
---
Identifies whether the SunAndShadowSettings element uses a ground plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool UsesGroundPlane { get; set; }
```

Visual Basic
---
```text
Public Property UsesGroundPlane As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UsesGroundPlane {
	bool get ();
	void set (bool value);
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace